(
  ; Context map
  {}

  "ศูนย์"
  "ว่าง"
  "ไม่มี"
  (number 0)

  "หนึ่ง"
  (number 1)

  "สอง"
  (number 2)

  "สาม"
  (number 3)

  "สิบ"
  (number 10)

  "สิบเอ็ด"
  (number 11)

  "สามสิบ"
  (number 30)

  "ยี่สิบเอ็ด"
  (number 21)

  "ยี่สิบสาม"
  (number 23)

  "สามสิบสาม"
  (number 33)

  "ร้อย"
  "หนึ่งร้อย"
  (number 100)

  "สองร้อย"
  (number 200)

  "สามร้อย"
  (number 300)

  "เก้าร้อย"
  (number 900)

  "ร้อยหนึ่ง"
  "ร้อยเอ็ด"
  "หนึ่งร้อยหนึ่ง"
  "หนึ่งร้อยเอ็ด"
  (number 101)

  "สองร้อยสอง"
  (number 202)

  "ร้อยสิบ"
  (number 110)

  "ร้อยยี่สิบ"
  (number 120)

  "สามร้อยยี่สิบ"
  (number 320)

  "สามร้อยสามสิบ"
  (number 330)

  "สามร้อยสามสิบเอ็ด"
  (number 331)


  "สามร้อยสามสิบห้า"
  (number 335)
)
